[
  {
    "Library": {
      "longDescription": "Large shelves of books standing tall like guardians of knowledge. Within this room contains boundless knowledge and tables to sit upon.",
      "shortDescription": "A room filled with books and places to read.",
      "visited": false,
      "RoomsConnected": [ "Hallway3" ],
      "roomInventory": [
        "Journal"
      ]
    }
  },
  {
    "Hallway 3": {
      "longDescription": "The furthest hallway connected to the library and bedroom of Lady Capulet. At night steps can be heard coming from this hallway but many have failed at identifying the source.",
      "shortDescription": "An eerie hallway connecting to Lady Capulet's bedroom and the library.",
      "visited": false,
      "RoomsConnected": ["Bedroom", "Library", "Hallway 2"],
      "roomInventory": [
      ]
    }
  },
  {
    "Dining Room": {
      "longDescription": "A sizable room adorned with priceless vases and paintings. This room has stood the test of time and entertained more guests than the years it has stood. This room is connected to the kitchen through a hidden door.",
      "shortDescription": "A glamorous room containing a dining table and connected to the kitchen.",
      "visited": false,
      "RoomsConnected": ["Kitchen", "Hallway 1"],
      "roomInventory": [
        "Burrito"
      ]
    }
  },
  {
    "Hallway 2": {
      "longDescription": "A short hallway connecting the two major hallways together. Though there are no rooms connected this sizeable area is decorated with the portraits of the Lady and Lord of the Manor. Some say their eyes follow them as they walk. Maybe the walls have eyes and ears.",
      "shortDescription": "An eerie hallway connecting Hallway 1 and Hallway 2",
      "visited": false,
      "RoomsConnected": ["Hallway 1", "Hallway 2"],
      "roomInventory": [
        "Hammer"
      ]
    }
  },
  {
    "Washroom": {
      "longDescription": "Practically a historical monument for surviving this long without water damage. Give the person maintaining this room a gold medal. This washroom belonged to Lady Capulet before her marriage and has been unoccupied since.",
      "shortDescription": "An ensuite bathroom connected to the bedroom of Lady Capulet.",
      "visited": false,
      "RoomsConnected": ["Bedroom"],
      "roomInventory": [
      ]
    }
  },
  {
    "Supplies CLoset": {
      "longDescription": "Recently developed dark closet to house strong checmicals, cleaning supplies and handy tools for use of the groundskeeper. Tread carefully ",
      "shortDescription": "An ensuite bathroom connected to the bedroom of Lady Capulet.",
      "visited": false,
      "RoomsConnected": ["Bedroom"],
      "roomInventory": [
      ]
    }
  }
]